tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
brew "bat"
brew "carapace"
brew "cmake"
brew "coreutils"
brew "eza"
brew "fd"
brew "lua"
brew "fennel"
brew "fzf"
brew "gcc"
brew "git"
brew "git-delta"
brew "just"
brew "lazygit"
brew "less"
brew "luajit"
brew "marksman"
brew "mas"
brew "micro"
brew "mpd", restart_service: :changed
brew "neovim"
brew "node"
brew "nushell"
brew "ripgrep"
brew "rsync"
brew "slugify"
brew "task"
brew "taskwarrior-tui"
brew "tealdeer"
brew "tree"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@30"
cask "ableton-live-suite"
cask "appcleaner"
cask "balenaetcher"
cask "brave-browser"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kitty"
cask "logseq"
cask "milkytracker"
cask "musicbrainz-picard"
cask "nvalt"
cask "obsidian"
cask "raycast"
cask "signal"
cask "skim"
cask "sunvox"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
mas "2020", id: 1106656393
mas "Xcode", id: 497799835
vscode "arr.marksman"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "enkia.tokyo-night"
vscode "kdl-org.kdl"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mattn.lisp"
vscode "mickael-menu.zk-vscode"
vscode "mvllow.rose-pine"
vscode "nefrob.vscode-just-syntax"
vscode "panicbit.cargo"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "vadimcn.vscode-lldb"
vscode "wgsl-analyzer.wgsl-analyzer"
vscode "yzhang.markdown-all-in-one"
